In [1]:
from sklearn.neighbors import NearestNeighbors

In [3]:
nn = NearestNeighbors(n_neighbors=3)

In [4]:
import pandas as pd

In [6]:
house_data = pd.read_csv('data/house_rental_data.csv',index_col='Unnamed: 0')

In [7]:
house_data.head()

       Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom  Price
1  1177.698      2           7        2            2         2  62000
2  2134.800      5           7        4            2         2  78000
3  1138.560      5           7        2            2         1  58000
4  1458.780      2           7        3            2         2  45000
5   967.776     11          14        3            2         2  45000

In [15]:
nn.fit(house_data[['Price']])

NearestNeighbors(algorithm='auto', leaf_size=30, metric='minkowski',
         metric_params=None, n_jobs=1, n_neighbors=3, p=2, radius=1.0)

In [18]:
house_data[:1]['Price']

1    62000
Name: Price, dtype: int64

In [19]:
nn.kneighbors(house_data[:1][['Price']])

(array([[    0.,  1000.,  1000.]]), array([[  0, 379, 354]], dtype=int64))

In [12]:
house_data.iloc[[354]]

        Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom  Price
358  1031.82     11          14        3            2         2  61000

In [20]:
house_data.iloc[[379]]

         Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom  Price
383  2184.612      4          14        3            2         2  63000